const description = [
  "그래프는 정점과 간선으로 이루어진 자료구조입니다. 실생활의 다양한 문제들을 그래프로 표현할 수 있습니다. ",
  "탐욕법, 탐욕 알고리즘(Greedy Algorithms은 문제를 해결하는 과정에서 그 순간순간마다 최적이라고 생각되는 결정을 하는 방식으로 진행하여 최종 해답에 도달하는 문제를 해결합니다.",
  "동적 계획법(Dynamic Programming)은 주어진 문제를 풀기 위해서, 문제를 여러 개의 하위 문제로 나누어 푼 다음, 그것을 결합하여 최종적으로 문제를 해결하는 방식입니다.",
  "문자 인코딩과 관련된 문자를 대표하는 일련의 자료값을 저장하고 있는 자료형입니다. 문자열을 비교하고 자유자재로 다루어보세요.",
  "LIFO, FIFO. 데이터를 효율적으로 관리하고 구조화한 목적에 맞는 자료구조를 활용해 보세요.",
  "원소들을 번호순이나 사전 순서와 같이 일정한 순서대로 열거하는 방법입니다. 효율적인 정렬 알고리즘을 사용해 데이터를 활용하세요.",
  "검색 대상이 되는 데이터 구조에 따라 효율적이고 빠른 탐색을 수행하세요. ",
  " 해쉬는 임의의 크기를 가진 데이터를 고정된 데이터의 크기로 변환시킵니다. 해시를 이용하면 문제를 더 효율적으로 해결할 수 있습니다.",
  "이진트리의 한 종류인 힙(heap)은 최댓값이나 최솟값을 빠르게 찾아내도록 만들어진 자료구조입니다.  이를 응용하면 우선순위 큐와 같은 추상적 자료형을 구현할 수 있습니다."
]

export default description